PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p18f96j60.inc
;----- INTCON2 Bits -----------------------------------------------------
RBIP             EQU  H'0000'
INT3IP           EQU  H'0001'
TMR0IP           EQU  H'0002'
INTEDG3          EQU  H'0003'
INTEDG2          EQU  H'0004'
INTEDG1          EQU  H'0005'
INTEDG0          EQU  H'0006'
NOT_RBPU         EQU  H'0007'

T0IP             EQU  H'0002'
RBPU             EQU  H'0007'


;----- INTCON Bits -----------------------------------------------------
RBIF             EQU  H'0000'
INT0IF           EQU  H'0001'
TMR0IF           EQU  H'0002'
RBIE             EQU  H'0003'
INT0IE           EQU  H'0004'
TMR0IE           EQU  H'0005'
PEIE_GIEL        EQU  H'0006'
GIE_GIEH         EQU  H'0007'

INT0F            EQU  H'0001'
T0IF             EQU  H'0002'
INT0E            EQU  H'0004'
T0IE             EQU  H'0005'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'

GIEL             EQU  H'0006'
GIEH             EQU  H'0007'


;----- STKPTR Bits -----------------------------------------------------
STKUNF           EQU  H'0006'
STKFUL           EQU  H'0007'

STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'
STKOVF           EQU  H'0007'

SP0              EQU  H'0000'
SP1              EQU  H'0001'
SP2              EQU  H'0002'
SP3              EQU  H'0003'
SP4              EQU  H'0004'



;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'0FFF'
       __BADRAM  H'0E86'-H'0E89'
       __BADRAM  H'0E8B'-H'0E96'
       __BADRAM  H'0E9A'-H'0E9F'
       __BADRAM  H'0EA1'
       __BADRAM  H'0EA5'
       __BADRAM  H'0EA8'-H'0EA9'
       __BADRAM  H'0EAC'-H'0EB1'
       __BADRAM  H'0EB3'
       __BADRAM  H'0EB5'
       __BADRAM  H'0EBA'-H'0EBF'
       __BADRAM  H'0ED2'-H'0ED3'
       __BADRAM  H'0ED6'-H'0ED7'
       __BADRAM  H'0EDA'-H'0EE1'
       __BADRAM  H'0EF8'-H'0EFA'
       __BADRAM  H'0EFC'
       __BADRAM  H'0EFF'-H'0F5F'
       __BADRAM  H'0FA8'-H'0FAA'
       __BADRAM  H'0FD4'

;==========================================================================
;
;   IMPORTANT: For the PIC18 devices, the __CONFIG directive has been
;              superseded by the CONFIG directive.  The following settings
;              are available for this device.
;
;   Watchdog Timer Enable bit:
;     WDT = OFF            WDT disabled (control is placed on SWDTEN bit)
;     WDT = ON             WDT enabled
;
;   Stack Overflow/Underflow Reset Enable bit:
;     STVR = OFF           Reset on stack overflow/underflow disabled
;     STVR = ON            Reset on stack overflow/underflow enabled
;
;   Extended Instruction Set Enable bit:
;     XINST = OFF          Instruction set extension and Indexed Addressing mode disabled (Legacy mode)
;     XINST = ON           Instruction set extension and Indexed Addressing mode enabled
;
;   Background Debugger Enable bit:
;     DEBUG = ON           Background debugger enabled; RB6 and RB7 are dedicated to In-Circuit Debug
;     DEBUG = OFF          Background debugger disabled; RB6 and RB7 configured as general purpose I/O pins
;
;   Code Protection bit:
;     CP0 = ON             Program memory is code-protected
;     CP0 = OFF            Program memory is not code-protected
;
;   Oscillator Selection bits:
;     FOSC = HS            HS oscillator
;     FOSC = HSPLL         HS oscillator, PLL enabled and under software control
;     FOSC = EC            EC oscillator, CLKO function on OSC2
;     FOSC = ECPLL         EC oscillator, PLL enabled and under software control, CLKO function on OSC2
;
;   Default/Reset System Clock Select bit:
;     FOSC2 = OFF          INTRC enabled as system clock when OSCCON<1:0> = 00
;     FOSC2 = ON           Clock selected by FOSC1:FOSC0 as system clock is enabled when OSCCON<1:0> = 00
;
;   Fail-Safe Clock Monitor Enable:
;     FCMEN = OFF          Fail-Safe Clock Monitor disabled
;     FCMEN = ON           Fail-Safe Clock Monitor enabled
;
;   Two-Speed Start-up (Internal/External Oscillator Switchover) Control bit:
;     IESO = OFF           Two-Speed Start-up disabled
;     IESO = ON            Two-Speed Start-up enabled
;
;   Watchdog Timer Postscaler Select bits:
;     WDTPS = 1            1:1
;     WDTPS = 2            1:2
;     WDTPS = 4            1:4
;     WDTPS = 8            1:8
;     WDTPS = 16           1:16
;     WDTPS = 32           1:32
;     WDTPS = 64           1:64
;     WDTPS = 128          1:128
;     WDTPS = 256          1:256
;     WDTPS = 512          1:512
;     WDTPS = 1024         1:1024
;     WDTPS = 2048         1:2048
;     WDTPS = 4096         1:4096
;     WDTPS = 8192         1:8192
;     WDTPS = 16384        1:16384
;     WDTPS = 32768        1:32768
;
;   External Address Bus Shift Enable bit:
;     EASHFT = OFF         Address shifting disabled; address on external bus reflects the PC value
;     EASHFT = ON          Address shifting enabled; address on external bus is offset to start at 000000h
;
;   External Memory Bus:
;     MODE = XM20          Extended Microcontroller mode, 20-Bit Address mode
;     MODE = XM16          Extended Microcontroller mode,16-Bit Address mode
;     MODE = XM12          Extended Microcontroller mode,12-Bit Address mode
;     MODE = MM            Microcontroller mode, external bus disabled
;
;   Data Bus Width Select bit:
;     BW = 8               8-Bit Data Width mode
;     BW = 16              16-Bit Data Width mode
;
;   External Bus Wait Enable bit:
;     WAIT = ON            Wait states for operations on external memory bus enabled and selected by MEMCON<5:4>
;     WAIT = OFF           Wait states for operations on external memory bus disabled
;
;   ECCP2 MUX bit:
;     CCP2MX = OFF         ECCP2/P2A is multiplexed with RE7 in Microcontroller mode (80-pin and 100-pin devices) or with RB3 in Extended Microcontroller mode (100-pin devices only)
;     CCP2MX = ON          ECCP2/P2A is multiplexed with RC1
;
;   ECCP MUX bit:
;     ECCPMX = OFF         ECCP1 outputs (P1B/P1C) are multiplexed with RH7 and RH6; ECCP3 outputs (P3B/P3C) are multiplexed with RH5 and RH4
;     ECCPMX = ON          ECCP1 outputs (P1B/P1C) are multiplexed with RE6 and RE5; ECCP3 outputs (P3B/P3C) are multiplexed with RE4 and RE3
;
;   Ethernet LED Enable bit:
;     ETHLED = OFF         RA0/RA1 function as I/O regardless of Ethernet module status
;     ETHLED = ON          RA0/RA1 are multiplexed with LEDA/LEDB when Ethernet module is enabled and function as I/O when Ethernet is disabled
;
;==========================================================================
;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'


        LIST
